11/data/attachments/2c30bf2e1d080fe5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_8466698a-a740-4d93-bb28-aec20f44308e</nif:username>
            <nif:friendToBeAdded>Kyle_high_Friend_28415_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>